Catalogs/ВидыОперацийВыгружаемыхВ7.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ВидыОперацийВыгружаемыхВ7</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВыгружаемыхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвояФирма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РЕКЛАМА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПОСТАВЩИКИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОПТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МАТЕРИАЛЫ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МАЛЬЧИКИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗАТРАТЫ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АРЕНДА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КудаВыгружать</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыВыгружаемыхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>ВидыВыгружаемыхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеМатериалов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыОперацийВыгружаемыхВ7/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидимостьЭлементовФормы()
	
	Элементы.ГруппаРекБВ.Видимость = (Объект.Документ = ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.Выписка"));
	Элементы.ГруппаРекОпер.Видимость = (Объект.Документ = ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.Операция"));
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьРеквизитыФормы()
	
	Если Объект.Документ = ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.Выписка") Тогда
		Массив = СтрРазделить(Объект.КудаВыгружать, ",",Истина);
		Если Массив.Количество() > 4 Тогда
			ДвижениеДС = СтрЗаменить(Массив[0], """", "");
			КоррСчет =   СтрЗаменить(Массив[1], """", "");
			Субконто1 =  СтрЗаменить(Массив[2], """", "");
			Субконто2 =  СтрЗаменить(Массив[3], """", "");
			Назначение = СтрЗаменить(Массив[4], """", "");
		КонецЕсли;
	ИначеЕсли Объект.Документ = ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.Операция") Тогда
		Массив = СтрРазделить(Объект.КудаВыгружать, ",",Истина);
		Если Массив.Количество() > 6 Тогда
			СчДт = СтрЗаменить(Массив[0], """", "");
			СубконтоДт1 =   СтрЗаменить(Массив[1], """", "");
			СубконтоДт2 =  СтрЗаменить(Массив[2], """", "");
			СчКт =  СтрЗаменить(Массив[3], """", "");
			СубконтоКт1 =   СтрЗаменить(Массив[4], """", "");
			СубконтоКт2 =  СтрЗаменить(Массив[5], """", "");		
			Содержание = СтрЗаменить(Массив[6], """", "");	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура РекБВПриИзменении(Элемент)
	
	Объект.КудаВыгружать = ""+СокрЛП(ДвижениеДС)+","+СокрЛП(КоррСчет)+","+СокрЛП(Субконто1)+","+СокрЛП(Субконто2)+","+СокрЛП(Назначение)+",";	
	
КонецПроцедуры

&НаКлиенте
Процедура КудаВыгружатьПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьЭлементовФормы();
	ЗаполнитьРеквизитыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РекОперПриИзменении(Элемент)
	
	Объект.КудаВыгружать = ""+СокрЛП(СчДт)+","+СокрЛП(СубконтоДт1)+","+СокрЛП(СубконтоДт2)+","+СокрЛП(СчКт)+","+СокрЛП(СубконтоКт1)+","+СокрЛП(СубконтоКт2)+","+СокрЛП(Содержание)+",";	
	
КонецПроцедуры
